{
    "version": "https://jsonfeed.org/version/1",
    "title": "Breathing Berry",
    "description": "",
    "home_page_url": "https://breathingberry.com",
    "feed_url": "https://breathingberry.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Surbhi Bhosle"
    },
    "items": [
        {
            "id": "https://breathingberry.com/breathing-berry.html",
            "url": "https://breathingberry.com/breathing-berry.html",
            "title": "Breathing Berry",
            "summary": "<p>Welcome! You have taken the first step towards your life. I assure you the journey ahead is not tough nor is it gloomy. Discovering the joys of healthy living is fun enough. And living a healthy lifestyle is both our destination and journey here. You can  explore it out solo, along with your friends, with our community of happiness enthusiasts at breathing berry. Not to mention I am there with you always in this lighted path. Let’s breathe health together!</p>\n<figure class=\"post__image post__image--wide\"><img loading=\"lazy\"  src=\"https://breathingberry.com/media/posts/7/gcfk70069OSNeXcHGbpo-1-TAHEC-2.jpg\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://breathingberry.com/media/posts/7/responsive/gcfk70069OSNeXcHGbpo-1-TAHEC-2-xs.jpg 300w ,https://breathingberry.com/media/posts/7/responsive/gcfk70069OSNeXcHGbpo-1-TAHEC-2-sm.jpg 480w ,https://breathingberry.com/media/posts/7/responsive/gcfk70069OSNeXcHGbpo-1-TAHEC-2-md.jpg 768w ,https://breathingberry.com/media/posts/7/responsive/gcfk70069OSNeXcHGbpo-1-TAHEC-2-lg.jpg 1024w\"  alt=\"\" width=\"1338\" height=\"159\"></figure>\n<p>Eating healthy is not difficult. It is the easiest change that we can make in our lifestyle to live a happy life. And Eating Healthy doesn’t mean eating tasteless and uninteresting food. Any food can be made tasty without losing its taste appeal. Balancing nutrition and your food fantasies is not at all out of reach. Enter to explore how you can do so!</p>\n",
            "content_html": "<p>Welcome! You have taken the first step towards your life. I assure you the journey ahead is not tough nor is it gloomy. Discovering the joys of healthy living is fun enough. And living a healthy lifestyle is both our destination and journey here. You can  explore it out solo, along with your friends, with our community of happiness enthusiasts at breathing berry. Not to mention I am there with you always in this lighted path. Let’s breathe health together!</p>\n<figure class=\"post__image post__image--wide\"><img loading=\"lazy\"  src=\"https://breathingberry.com/media/posts/7/gcfk70069OSNeXcHGbpo-1-TAHEC-2.jpg\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://breathingberry.com/media/posts/7/responsive/gcfk70069OSNeXcHGbpo-1-TAHEC-2-xs.jpg 300w ,https://breathingberry.com/media/posts/7/responsive/gcfk70069OSNeXcHGbpo-1-TAHEC-2-sm.jpg 480w ,https://breathingberry.com/media/posts/7/responsive/gcfk70069OSNeXcHGbpo-1-TAHEC-2-md.jpg 768w ,https://breathingberry.com/media/posts/7/responsive/gcfk70069OSNeXcHGbpo-1-TAHEC-2-lg.jpg 1024w\"  alt=\"\" width=\"1338\" height=\"159\"></figure>\n<p>Eating healthy is not difficult. It is the easiest change that we can make in our lifestyle to live a happy life. And Eating Healthy doesn’t mean eating tasteless and uninteresting food. Any food can be made tasty without losing its taste appeal. Balancing nutrition and your food fantasies is not at all out of reach. Enter to explore how you can do so!</p>\n\n<p> </p>\n<p>Sleeping is an act which ties together your health and your body together into a perfect harmony. Its as important as eating healthy and exercising although both affect this precious routine significantly. Sleep is a gateway to not only physical but your mental wellbeing. Explore the ways to achieve a goody good goodnight sleep!</p>\n\n<p> </p>",
            "author": {
                "name": "Surbhi Bhosle"
            },
            "tags": [
            ],
            "date_published": "2022-09-13T11:05:59+05:30",
            "date_modified": "2022-09-13T19:08:46+05:30"
        },
        {
            "id": "https://breathingberry.com/wellness-for-remote-workers.html",
            "url": "https://breathingberry.com/wellness-for-remote-workers.html",
            "title": "Breathing Berry offers a complete solution to a healthy life. Let&#x27;s breathe life together. Join our community.",
            "summary": "Most of us have experienced working remotely and chances are that some&hellip;",
            "content_html": "<p> </p>\n<p><span style=\"font-weight: 400;\">Most of us have experienced working remotely and chances are that some of us will do it again, some will always. The most important thing that we don’t pay attention to while working remotely is observing discipline. We may stay late at the office sometimes but when we get to home we stay present, more engaged with our family and our home feels vastly relaxing, on the other hand while working remotely the boundary between work and personal time blurs out significantly. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Being in the same environment makes our relaxing time a little less effective, as the same setting can induce work mode inertia and we can keep thinking about it. Sitting for too long, juggling your laptops between work desks, sofa and bed, remote workers are more prone to musculoskeletal problems like neck and back pain. While these factors impact our health greatly we accept them as part of our remote work lifestyle and seldomly take any steps to counter them. </span></p>\n<p><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">Mental health issues are the most common outcomes of work from home lifestyle. These issues not only affect our happiness quotient but also can become disabling while manifesting physical symptoms. When we work remotely we are isolated, not in the physical company of our friends and colleagues, there is constant pressure to respond to messages, our screen time increases manifold, and our movements are restricted to bathroom and food breaks. This takes a toll on not only our physical health but also mental.  Let’s dive into what steps can we take to keep ourselves fit while working remotely:</span></p>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Setup office space: Setting up a dedicated office space helps increase your focus and productivity. Choose ergonomic furniture to set up the workspace. Uncomfortable furniture can lead to wrong posture which can make you feel tired, irritated and in body pain( especially back and neck.(</span><i><span style=\"font-weight: 400;\">Link to exercises and Yoga poses for back pain in 3rd point</span></i><span style=\"font-weight: 400;\">). Follow tips for a proper setup like keeping the monitor at or below eye level and using a chair with armrests and seat height such that your feet can rest flat on the floor.</span></li>\n</ol>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Also, having a clean and organized work area is essential. An uncluttered space immediately lets out a positive vibe and not only your productivity increases but your times get saved manifold.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Some links to articles for setting up an optimum remote work office setup:</span></p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><a href=\"https://www.computerworld.com/article/3545478/how-to-set-up-a-work-from-home-office-for-the-long-term.html\"><span style=\"font-weight: 400;\">How to set up a WFH 'office' for the long term | Computerworld</span></a></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><a href=\"https://www.wired.com/story/work-from-home-home-office-gear-guide/\"><span style=\"font-weight: 400;\">Everything You Need to Work From Home Like a Pro</span></a></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><a href=\"https://blog.vantagecircle.com/work-from-home-setup/\"><span style=\"font-weight: 400;\">Work From Home Setup - What Every Employee Must Have</span></a></li>\n</ol>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Form a Routine: The most underrated reason of why working remotely can give rise to health challenges is failure to set up a routine. While at home we mold ourselves according to the work calls and house chores as and when they come instead of organizing and setting up a system in which we can balance our time dedicated to work and time for health and relaxation. </span></li>\n</ol>\n<p> </p>\n<p><span style=\"font-weight: 400;\">It is important to acknowledge that while working remotely, the line between work and home can blur out pretty easily and then work out ways to prevent it from happening. Small things like including a dedicated lunch time and short breaks to stretch yourself and relax, detaching yourself completely from work after a set time and not compromising on your sleeptime goes a long way in keeping you fit.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Use planner tools and mitigate ‘a no break day’ by accommodating any deadline load, kind of office work or  a visit to your child’s school for a parent teacher meeting by planning ahead. Creating a to-do list and allocating time for them beforehand such that you don’t have to give away your precious lunch breaks can help in preventing stress and burnouts that usually come out of such days.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Link to article informing about planner and to-do tools(some might help you professionally as well):</span></p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><a href=\"https://www.ventureharbour.com/best-to-do-list-apps/\"><span style=\"font-weight: 400;\">10 To-Do List Apps &amp; Day Planners to Get More Done in 2022</span></a></li>\n</ol>\n<p><br><br></p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Exercising and Outdoor activities: Getting out for fresh air is not some old time cliche health tip but it really works and impacts our health positively. Schedule outdoor time regularly at the very least half an hour everyday. Soak up some sun and refresh yourself with a burst of oxygen. We ignore these very basic foundation elements of our body - Vitamin D and Oxygen. You can engage in activities you like to help make a habit like cycling, running, gardening, walking or even meeting up with your neighbors for some gossip time in the backyard. </span></li>\n</ol>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Including exercise slots in the routine schedule is a must for everybody whether working remotely or even from the office. Everyone of us is aware of the advantages of exercising regularly but to accommodate it in our routine is what most of us find difficult and while some simply chose to ignore. Giving half an hour to your favorite kind of exercise (be it cardio or some Yoga poses) is better than missing out on it for lack of time. Remember focusing on health is as important as working to earn money. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Also, I can't stress enough the importance of moving. Get up and move. Don’t sit for long hours continuously. It's okay to switch off your videos and walk around your room while attending the meeting. You can also accommodate a standing desk and alternate your work desks.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Checkout </span><a href=\"https://www.youtube.com/c/yogawithadriene\"><span style=\"font-weight: 400;\">Yoga With Adriene - YouTube</span></a><span style=\"font-weight: 400;\"> (You can find some amazing sessions on neck and back problems here as well) and </span><a href=\"https://www.youtube.com/c/LeslieSansonesWalkatHome\"><span style=\"font-weight: 400;\">Walk at Home - YouTube</span></a><span style=\"font-weight: 400;\"> </span></p>\n<p><br><br></p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Socializing: Spending time with your loved ones is very important for your mental health. While being in office, socializing with colleagues is inevitable, it does not come out naturally while working remotely. You need to take efforts and initiative for it but it is all worth it. Small casual conversations can make a lot of difference in mentally refreshing yourself and to heed away the isolation blues that come along with this work model. </span></li>\n</ol>\n<p> </p>\n<p><span style=\"font-weight: 400;\">If you live with family, take out time for them after your office hours, have dinner together, even lunch together if it can be accommodated. Meeting friends and loved ones should not be on the list of one that can be done on weekends only. Also, coming to weekends, they are your days off so let them be. Do what you love to do and can’t on weekdays. Make the weekend a short refreshing break from all the hard work you do on workdays without any guilt. It's okay not to work!</span></p>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Meditate: Yes it needs special mention! Meditate for only a few minutes if that is all you can find time to. Squeeze in small meditation breaks. The good thing about meditation is that it can be done anytime and so do it anytime. </span></li>\n</ol>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Practicing meditation regularly helps in reducing stress and anxiety, increasing self awareness and cultivating patience, tolerance and positivity, increases concentration and helps in reducing age related memory loss. It can also negate the harmful effects of log screen times and mental exhaustion that come with remote working style. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">There is a lot of some really substantial stuff online for consumption regarding meditation. You can also attend a meditation class and learn from it. There are some awesome guided meditation apps too, link for the article informing about them: </span></p>\n<p><a href=\"https://www.healthline.com/health/meditation-online\"><span style=\"font-weight: 400;\">10 Best Places for Guided Meditation Online in 2022</span></a></p>\n<figure class=\"post__video\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://breathingberry.com/media/posts/4/Illustrated-Digital-Wellbeing-Infographic-1.gif\" alt=\"\" width=\"682\" height=\"1706\"></figure></figure>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Healthy diet and Hydration: Eating erratically while working out of home and ignoring healthy eating is a major cause of deteriorating health and rising obesity. We have access to the kitchen all the time and snacking unhealthy stuff has become very easy. Eating too much processed foods and ready to eat meal packets have devastating effects on our bodies. Instead of leaving your diet at the mercy of time availability in your busy schedule, plan it out. You are not wasting your time but taking efforts to plan and organize the one most important aspect of your health, so dedicate some time to it. Checkout </span><a href=\"https://www.simplyrecipes.com/best-meal-planning-apps-5181526\"><span style=\"font-weight: 400;\">Best Meal Planning Apps of 2022</span></a></li>\n</ol>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Staying hydrated is very easy but also the one most forgetful ritual. Fill up some bottles beforehand and keep it on your desk. Try finishing them up before you complete your day's work. It is one easy way to keep yourself refreshed and energetic. If you still want some app assist then here is the link: </span><a href=\"https://www.bustle.com/p/5-apps-that-can-help-you-drink-more-water-9765586\"><span style=\"font-weight: 400;\">5 Apps That Can Help You Drink More Water</span></a></p>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Eye health: Mentioning it specially as an individual point to stress its importance. While use of technology makes most of our work easy, one thing that gets immensely strained in the process are our eyes. Today whatever you are doing, the presence of a screen in front of your eyes is almost always there. This constant screen time can make your eyes dry, weaken the eye muscles and some studies also suggest the blue light can damage the cells in the retina. Frightened enough? Actually taking care of eyes is very easy and you can maintain their health by keeping in mind only few tips:</span></li>\n</ol>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Blink regularly and consciously. </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Drink water and stay hydrated.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Sit about two feet away from a computer screen to reduce eyestrain.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Make sure the center of the computer monitor is slightly lower than eye level — four to eight inches.</span><span style=\"font-weight: 400;\"> </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Use a matte screen filter to reduce glare on your smartphone, computer screen, or table.</span><span style=\"font-weight: 400;\"> </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Use a larger font to keep your eyes from working hard to see letters.</span><span style=\"font-weight: 400;\"> </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Reduce glare with softer lighting.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Schedule regular eye checkups and visit a doctor if any eye symptoms come up. Most of the eye problems caused by longer screen times like dry eyes and eye strain can be treated easily and therefore do not delay visit to an eye clinic.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Exercise your eyes at regular intervals and take breaks at regular intervals away from the screen. You can use the famous 20 20 20 rule for preventing eye strain: </span><strong>every 20 minutes spent using a screen; you should try to look away at something that is 20 feet away from you for a total of 20 seconds</strong><span style=\"font-weight: 400;\">. Checkout: </span><a href=\"https://www.youtube.com/watch?v=32l0HszBWBc\"><span style=\"font-weight: 400;\">Yoga for Eyes | Eye Exercises to Improve Eyesight Naturally | Sri Sri Yoga</span></a></li>\n</ul>\n<p><span style=\"font-weight: 400;\">      </span></p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Digital Wellbeing: Digital well-being means having a healthy relationship with the technology such that it promotes healthy use habits and the user leads a healthy lifestyle. It's a new term but I think it can be very helpful since it is the use of technology that is causing us these problems, perhaps the optimum use of technology and even using the same to counter its own effects can be very interesting. Take a short course by google(It's hardly 19 minutes) to learn more about this at: </span><a href=\"https://learndigital.withgoogle.com/digitalgarage/course/digital-wellbeing/module/220/lesson/221\"><span style=\"font-weight: 400;\">Intro to digital wellbeing</span></a></li>\n</ol>\n<p> </p>\n<p><span style=\"font-weight: 400;\">While working from home every meeting that could have been a pure physical gathering gets converted into extra long ‘stick to the screen’ video calls. Such increased use of technology can lead to physical and mental issues such as attention span issues, behavioral changes, stress, anxiety and burnout. Following are only a few of many tips and with giants like google coming up with technologies that  promote digital well-being, there are many ways to stay fit even in an intense digital setting. Let’s see some of them:</span></p>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Implement screen time limits. Force yourself to take breaks. There are tools available for this (ColdTurkey, Freedom, FocusMe, SprintWork for windows and macOS, if you work too much out of your phone than you have Digital Wellbeing for android and Screen Time for ios) or you can simply put an alarm after a specific time, getup and walk away from screen.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Wear blue light blocking glasses everytime you come in front of any screen.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Muting notifications from apps both on PC and cell phones</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Using apps to automate your repetitive simple tasks</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Keeping devices in ‘do not disturb’ mode while sleeping, tracking your sleep and using tools to remind that it is your bedtime.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Blocking up some time on calendar to meet with friends and family</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Using fitness tools and wearable fitness gadgets to track your health and motivate yourself to take walks or do work outs or even meditate.</span></li>\n</ul>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Alcohol consumption and Smoking: I am giving it a special mention because these habits can get a boost if people are not working from offices. You have the freedom to sip that one glass of wine abruptly at any time and take it over to two or three because ‘you can’ in the comfort of your home. That restrained smoking breaks in offices can get converted to innumerable in a day while working remotely. Take control of these harming desires and maintain discipline in these areas. They can be seriously damaging to your body and if you care more, then yes, your career too!</span></li>\n</ol>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Especially for women: Women working remotely mostly prefer to work out of homes so that they can better take care of their household responsibilities. And these responsibilities are truly unfairly distributed amongst them and their male partners. While remote work might turn out to be a blessing in certain ways but then it is also a curse when it comes down to their workload and health. Stress, depression, anxiety and being overworked is not new to any woman and these increase when you do not have a distraction free office space and have to juggle between job and home chores. Some tips for women working remotely:</span></li>\n</ol>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Do not worry about perfection and lower your own expectations of how productive you should be in a day. It's okay if some of the work gets done tomorrow or if your baby had that yellow stain still remaining on his/her beep or a patch of dirt still remains at your front porch or it's just cereal for breakfast. Learn to let go and be easy on yourself.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Set your expectations clearly with your partner. You are not the only one who should be worrying about family health and maintaining hygiene at your home or your child’s homework. Understand that your partner is equally responsible for all of these. Divide your work fairly and make adjustments in times of official urgencies. Plan chores with your partner at the end/start of the week and you can even involve your children in it. </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Take time off completely from the office as well as home. Get out with your friends and have a gossip session or some shopping time once a while. Schedule ‘me-time’ regularly and pamper yourself.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Take care of your diet and plan ahead your meals.</span></li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 400;\">All of the above tips for staying fit and healthy while working remotely may seem overwhelming but if you think on it these, all are simple habits. Take on two at a time, like planning a meal and going on a brisk walk, and then slowly you will find that they become regular because all of these while being numerable are all actually very basic foundations of how you should be living a healthy life. They are not hard to follow and a small effort from your side to keep your own body fit will keep you healthy for a long time.</span></p>\n<p><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br></p>",
            "image": "https://breathingberry.com/media/posts/4/pexels-eli-sommer-3992776.jpg",
            "author": {
                "name": "Surbhi Bhosle"
            },
            "tags": [
            ],
            "date_published": "2022-08-22T11:13:23+05:30",
            "date_modified": "2022-09-12T13:28:45+05:30"
        },
        {
            "id": "https://breathingberry.com/guide-to-your-goodnight-sleep.html",
            "url": "https://breathingberry.com/guide-to-your-goodnight-sleep.html",
            "title": "Guide to your Goodnight Sleep",
            "summary": "Photo by Egor Vikhrev on Unsplash Most of us have experienced sleep&hellip;",
            "content_html": "<p>Photo by <a href=\"https://unsplash.com/@egor_vikhrev?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Egor Vikhrev</a> on <a href=\"https://unsplash.com/collections/bX8nhcJOhjs/sleep?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a> </p>\n<p><span style=\"font-weight: 400;\">Most of us have experienced sleep problems at some point of time, those who haven’t are the mighty lucky ones. Having a good sleep is like an undervalued boon, you get it, you forget to be grateful about it and think that it is just another body function which you don’t have to make an effort for. But as you age or as you go through life's stressful moments caused by even the smallest of responsibility on your head you realise that such is not the case. You long for those nights when you would go to bed and even a ringing bell in the ear would not have been able to wake you up.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Though in some cases sleep disorders like narcolepsy, restless leg syndrome, sleep apnea can have causes such as genetic, neurological or hormonal but most of the sleeping problems have their roots in lifestyle and sudden changes in it. Here we will discuss what changes we can make in our lifestyle and which foods can we include in our diet to get a goody-good night's sleep.</span></p>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Same time works!: Developing a sleep routine helps the body recognise and maintain the sleep cycle. So sleep at the same time and wake up at the same time everyday, so that it doesn’t get disturbed. </span></li>\n</ol>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">No oversleeping: As much as we worry about getting less sleep, oversleeping can also create sleep problems for you. Sleep for 12 hours straight and then you may realise the next night you are unable to sleep, disturbing your sleeping pattern which will have effects for days to come. Set no more than 7-8 hours of sleep time. It is enough for almost every body to get the body rested and energised (babies and children may require more)</span></li>\n</ol>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Be active: Walk more, exercise for at least half an hour a day and let go of a sedentary lifestyle. Staying active promotes better sleep. However one point to note is that exercising close to your sleep may hinder the sleep process as it may increase mind alertness and body temperature.</span></li>\n</ol>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Relax before sleep: Relaxing before sleep hours will create a sleep conducive mind and body state. Try out different relaxing techniques like meditation, simple deep breathing, hearing to soothing music, taking a bath before sleep time and see what works well for you. </span>You need to find ways to leave your worries and stress outside your bedroom. Worries and stress stimulates your mind alertness greatly and hinders the sleep process. Journaling and jotting down your thoughts and worries before sleep may also work wonders for you. I find reading books (on non electronic devices) to be my ultimate sleeping pill, try it out!</li>\n</ol>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Invest in your sleep room: Not talking about investing money but efforts! Yes you need to create an environment which also promotes sleep and relaxation. Having a cluttered and messy bedroom is a strict no no. Clean up your bedroom everyday before you go to work or after you come home, so that when you go to sleep, you can actually sleep in a refreshing and relaxing ambience. </span>Apart from hygiene, you should regulate the temperature according to your comfort, have blinds installed in your bedroom windows so that outside light will not cause any problems, use a night reading lamp if you read before sleep, avoid bright lights in the bedroom, use ear plugs if required, disheartening but keep TV out of your reach while sleeping, in short you need to create a sleep friendly bedroom!</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Oh, almost forgot to draw your attention to one of the most important and highly underrated factors that contributes towards bad sleep, the bed in which you sleep. Yes, here you might have to invest monetarily as well here, but nowadays there are many sleep friendly ortho options available for mattresses as well as pillows. Make sure to find out the best one for you and bring it home because you are contributing ultimately towards your good health.</li>\n</ol>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://breathingberry.com/media/posts/3/Green-Colorful-Health-Benefits-Of-Fruit-Infographic.jpg\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://breathingberry.com/media/posts/3/responsive/Green-Colorful-Health-Benefits-Of-Fruit-Infographic-xs.jpg 300w ,https://breathingberry.com/media/posts/3/responsive/Green-Colorful-Health-Benefits-Of-Fruit-Infographic-sm.jpg 480w ,https://breathingberry.com/media/posts/3/responsive/Green-Colorful-Health-Benefits-Of-Fruit-Infographic-md.jpg 768w ,https://breathingberry.com/media/posts/3/responsive/Green-Colorful-Health-Benefits-Of-Fruit-Infographic-lg.jpg 1024w\"  alt=\"\" width=\"800\" height=\"2000\"></figure>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Some damaging things to avoid: </span></li>\n</ol>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Avoid taking long naps during the day. A short power nap of about 20 mins to half an hour is fine, especially older people may need it as their night sleeping hours usually gets shortened with age. If you feel your mind is overworked and shutting down, a short nap is recommended, although those already facing sleeping problems at night try not to sleep during the day.</span></li>\n</ul>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Avoid screens (phones, tv, laptops, any bright light emitting screen) at least an hour before sleep. The bluelight will mess up with your sleep cycle majorly hindering the initiation of it. </span></li>\n</ul>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Avoid consumption of alcohol and quit smoking! I don’t want to be lenient here and tell you to avoid smoking just hours before your sleep, I want you to give it up forever. I understand for smokers I am just one more person to tell you to give up on smoking but every try and every effort counts for making somebody give up on such a vastly self sabotaging habit/addiction. </span></li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 400;\">This article is still about sleeping and so to add to one more con related to our topic, nicotine is a stimulant and which will make you stay awake for longer and make it difficult to fall asleep along with messing up with your </span><a href=\"https://www.sleepfoundation.org/stages-of-sleep/rem-sleep\"><span style=\"font-weight: 400;\">REM sleep</span></a><span style=\"font-weight: 400;\">. Smokers are prone to waking up frequently during night sleep and having a less deep sleep.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">About alcohol consumption, don’t consume it in the evenings. Preferably keeping a 4 -5 hours of gap before going to bed is advisable. Although you may argue that it just puts you to sleep quickly but though initially sedating it disrupts your REM sleep, decreases your overall sleep quality and you may find yourself tired and unfocused the next day. According to the sleep foundation, consuming even a low amount of alcohol (less than 2 drinks for men and less than 1 drink for women) decreases the sleep quality by 9.3%.</span></p>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Avoid having heavy meals and caffeine as you come closer to your sleep time. It is generally healthy to eat less at night. Your body’s metabolism slows down at night and it prepares for sleep, but eating heavy will make your body work more to digest and it will find it harder to fall in rest mode and sleep. Eating heavy might result in acid refluxes and heartburn making it very uncomfortable for you to sleep. </span></li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Also, I would suggest you cut down your caffeine intake especially after the afternoon. We all know caffeine is a stimulant and stays for fairly long in our systems, so avoiding it completely as you come close to evening time is better for your sleep.</span></p>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Do not take any unprescribed medications that can affect your sleep. Whether you are taking medication to sleep or to self-treating any other condition, I strongly would recommend consulting your doctor especially when you are already experiencing sleeping problems.</span></li>\n</ul>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Avoid drinking too much water just before sleeping. Although drinking water does help the body in staying hydrated throughout the night when you sleep, drinking a lot can cause you to get up more often for urine breaks and disturb the sleep. Instead I would suggest to keep drinking water throughout the day regularly to keep your body well hydrated and to avoid consuming it 1-2 hours before sleep. If you feel thirsty just before sleeping you can have a small glass of water.</span></li>\n</ul>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Last one but an important one is to stop worrying about not getting enough sleep. Worrying about it may lead to stress and anxiety which further will contribute to the condition. If you are unable to control it and getting stressed, it's best to see a therapist or a sleep expert. </span></li>\n</ul>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">For new parents: If you have an infant at home, it's difficult to get that 7-9 hours of sleep in a stretch, sometimes there is absolutely none, especially when your child has fallen ill. This is a whole giant topic in itself but help is certainly available. I can give you a few pointers (all the above tips are also to be paid attention to) but you can also join support groups of new parents and even consult a specialist, as at such vulnerable times you need motivation the most. Let’s scroll through some tips.</span></li>\n</ol>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Sleep when your baby is sleeping and instead of thinking like all other parents often do, that is to complete the house chores in the meantime, i would strictly suggest against this. Sleep and rest should be your first priority at such times.</span></li>\n</ul>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Take all the help you can. Do not hesitate to ask for it from your family members and friends. Take assistance from a helper if you can. There is nothing wrong in it because you need to be physically and mentally fit in order to provide the best care to your newborn.</span></li>\n</ul>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Share nighttime duties. </span></li>\n</ul>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Keep the baby in a separate cot/crib but near your bed especially if you are breastfeeding.</span></li>\n</ul>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Keep your baby active and alert during daytime as much as possible and create a calm, cool and dim environment as the evening approaches. This will help them understand the day-night difference and also make them sleep for longer stretches at night.</span></li>\n</ul>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">For night shift workers: Now the difficult case of night shift workers. Although all the points remain the same, replace ‘night’ with ‘sleep time’ when you find one on the page. Two additional points for them though:</span></li>\n</ol>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">One additional thing is to create a disturbance free environment for sleep. So you need to convey the feelings to your family members, friends or the roommate so that they abide by. And if you are a pet parent figure out a way to keep them out of the bedroom or in silent mode while you sleep.</span></li>\n</ul>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Regulating your light exposure will help you a lot in forming a sleeping pattern and setting up your body clock accordingly. Have enough bright lights around while working at night. Exposure to even an artificial bright light can trick the circadian pacemaker in your body to take it as sunlight and thus helps maintain the sleep wake cycle. Also if you go out to work and come back when it is sunny outside then wear sunglasses and dim your environment as you near your sleep time. This will help you in falling asleep effortlessly.</span></li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 400;\">These are lots of points but certainly sustainable changes to pay attention to and make them a part of our lifestyle. It's worth remembering that we are making these efforts for our health, the sole most important thing. Also, I could not stress enough to keep on following the routine based on the above suggestions and be consistent. Sometimes all you require to lead a healthy life is to be consistent in developing small habits which promotes health.</span></p>\n<p><br><br><br><br><br><br><br><br><br><br><br><br><br></p>",
            "image": "https://breathingberry.com/media/posts/3/egor-vikhrev-olyI4zK0WFk-unsplash.jpg",
            "author": {
                "name": "Surbhi Bhosle"
            },
            "tags": [
            ],
            "date_published": "2022-08-22T10:58:44+05:30",
            "date_modified": "2022-08-22T10:58:44+05:30"
        },
        {
            "id": "https://breathingberry.com/lifestyle-for-a-vertigo-victim.html",
            "url": "https://breathingberry.com/lifestyle-for-a-vertigo-victim.html",
            "title": "Lifestyle for a Vertigo Victim",
            "summary": "If your dizziness and nausea have been labeled 'Vertigo', welcome to the&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">If your dizziness and nausea have been labeled 'Vertigo', welcome to the club! You are not the 'Chosen One', but just another victim of vertigo. According to the research data, vertigo and balance-related problems are the most common health problems in the adult population, with women more likely to experience them than men. Almost 40% of U.S. adults suffer from vertigo at least once in their lifetime. Interestingly, it is not a disease in itself, yet a symptom bothersome enough to be considered lifestyle changing. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">While vertigo presents itself as a manifestation of varying conditions, some of the common culprits are Benign Paroxysmal Positional Vertigo(BPPV), Meniere's Disease, Viral and Bacterial Labyrinthitis,</span><strong> </strong><span style=\"font-weight: 400;\">Vestibular Neuritis, and Cholesteatoma. It is the result of problems with the vestibular system that regulates the balance, orientation in space, and posture of the body. Also, there are other neurological conditions like Multiple Sclerosis, Brain tumor, Stroke along with non-neurological conditions like low blood pressure, Migraine, Diabetes, and stress.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Vertigo for some may be just a short passing symptom, yet for even them it certainly can be a disabling factor while making the performance of routine tasks difficult. As such their living quality gets affected negatively to a large extent. Along with treating the underlying conditions and certain precautions suggested by the doctor for an ongoing vertigo episode, there are ways to restrict it by making some holistic changes in your lifestyle. These simple changes will help dealing with vertigo and fortify your basic body systems like the vestibular and nervous systems that are causes of concern here. Let us look at these simple habits that can make your life lot better.</span></p>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Yoga: Yoga comes in first, and with a significant weight on its side. Daily practice of a few asanas goes a long way in giving strength to your nervous system by regulating the blood flow to the head and other parts of your body. Healthy nervous system is a key to preventing dizziness and balance disorders. Also, Yoga is a stress buster which is again a trigger to the vestibular problems resulting in vertigo. Following are the noted asanas. Every asana has a link to a video showing how to perform it.</span></li>\n</ol>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Note: During the vertigo attack, it is better to rest for some time when the severity is at its peak and wait for symptoms to subside. These Yoga postures should be part of your daily lifestyle to gain the utmost benefit and prevent the disorders from occurring. Also, if the vertigo is BPPV (Benign Paroxysmal Positional Vertigo), it would be sensible to go in the postures very slowly and avoid any jerky actions, especially with the neck and head.</span></p>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><a href=\"https://youtu.be/eSeRjoolN2A\"><span style=\"font-weight: 400;\">Shavasana</span></a><span style=\"font-weight: 400;\">: Let’s start from the easiest and the favorites of the non-yogis. Shavasana, also called the 'Corpse Pose', induces the body in a deep state of rest. It helps in relaxing, reducing stress, regulating blood pressure, and managing sleep problems, all of which can trigger vertigo. Also, if you are dizzy and lying down is one position you feel comfortable, </span><a href=\"https://youtu.be/eSeRjoolN2A\"><span style=\"font-weight: 400;\">trying Shavasana </span></a><span style=\"font-weight: 400;\">or even deep breathing can bring you relief, sometimes almost instantly.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><a href=\"https://youtu.be/gX2eckMb6xU\"><span style=\"font-weight: 400;\">Shanmukhi Mudra:</span></a><span style=\"font-weight: 400;\"> This Yoga asana is magic when it comes to calming the mind and the nervous system. It helps in balancing the inner and external awareness, enhancing focus, and reducing anxiety. It is easy to practice and doesn’t require any kind of bending or jerky movements. Simply sit in any comfortable position and you are ready to </span><a href=\"https://youtu.be/gX2eckMb6xU\"><span style=\"font-weight: 400;\">practice it</span></a><span style=\"font-weight: 400;\">.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><a href=\"https://youtu.be/8VwufJrUhic\"><span style=\"font-weight: 400;\">Nadi Shodhan Pranayama</span></a><span style=\"font-weight: 400;\">: Also called 'Alternate Nostril Breathing', it is a deep breathing practice that soothes the mind, body, and emotions, pulling you towards inner calmness. It circulates the blood throughout the body and brain, bringing out harmony. </span><a href=\"https://youtu.be/8VwufJrUhic\"><span style=\"font-weight: 400;\">Practicing it </span></a><span style=\"font-weight: 400;\">will help you feel centered which is good for enhancing the balancing awareness.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><a href=\"https://youtu.be/T8sgVyF4Ux4\"><span style=\"font-weight: 400;\">Paschimottanasana</span></a><span style=\"font-weight: 400;\">: This asana is a little challenging in nature and better avoided during a vertigo episode or early stage of recovery from the attack, but its routine practice is very effective in curing vertigo. </span><a href=\"https://youtu.be/T8sgVyF4Ux4\"><span style=\"font-weight: 400;\">Paschimottanasana</span></a><span style=\"font-weight: 400;\"> is a calming posture and helps with anxiety and depression that are triggers for vertigo. The beginners should find their comfortable version of this asana and let go of the desire to perform it perfectly. </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><a href=\"https://www.youtube.com/watch?v=V1HbXt5ZRlg\"><span style=\"font-weight: 400;\">Salamba Sirsana</span></a><span style=\"font-weight: 400;\">: Time for a headstand! Again, pass this one during the ongoing malady but try adopting it in your daily yoga practice. It's difficult but with time it can be done perfectly. Do take guidance if required for this pose. This variation of </span><a href=\"https://www.youtube.com/watch?v=V1HbXt5ZRlg\"><span style=\"font-weight: 400;\">headstand </span></a><span style=\"font-weight: 400;\">works wonders for the brain, heart, and the nervous system pulling blood to them. It is restorative for the cardiovascular and lymphatic systems and energizes the whole body.</span></li>\n</ol>\n<p> </p>\n<p><span style=\"font-weight: 400;\">2) Walking: We cannot stay away from a special mention to ‘walking’. Walk as you want to walk, slowly, briskly, or fast depending on how your body and energy levels permit that day. But walking is one of the easiest and most effective ways to stay fit. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Walking becomes more relevant to vertigo victims as it is supportive of balance building. You are working your muscles, strengthening them, and boosting your blood flow throughout the body while walking. There are specific </span><a href=\"https://www.cigna.com/individuals-families/health-wellness/hw/vertigo-ug1288\"><span style=\"font-weight: 400;\">walking exercises</span></a><span style=\"font-weight: 400;\"> for vertigo patients to improve their balance. Practice them only after consulting your doctor.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">3) Diet: What you feed your body is of utmost importance when it comes to managing symptoms like vertigo. Not only does a good diet help you do that but it effectively targets the underlying conditions to restore your complete body health. It's also about what you should avoid, to help your body recover fast and prevent the attacks from reoccurring. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Let us first start with some food remedies which can help you while you are experiencing the dizziness bouts:</span></p>\n<figure class=\"post__image align-center\"><img loading=\"lazy\"  src=\"https://breathingberry.com/media/posts/2/FinalFoodsforVertigo.jpg\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://breathingberry.com/media/posts/2/responsive/FinalFoodsforVertigo-xs.jpg 300w ,https://breathingberry.com/media/posts/2/responsive/FinalFoodsforVertigo-sm.jpg 480w ,https://breathingberry.com/media/posts/2/responsive/FinalFoodsforVertigo-md.jpg 768w ,https://breathingberry.com/media/posts/2/responsive/FinalFoodsforVertigo-lg.jpg 1024w\"  alt=\"\" width=\"708\" height=\"1769\"></figure>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://breathingberry.com/media/posts/2/FoodsForVErtigo-1.pdf\" alt=\"\" width=\"NaN\" height=\"NaN\"></figure>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Almonds: Almonds are good in any way they are eaten. You can roast them, eat as they are, or soak them overnight. What you need to avoid is seasoning them with salt. The easiest, tastiest, and boosted way, especially helpful when you are suffering from vertigo episodes, is to soak the almonds overnight, peel them, grind them and make a paste. Mix this paste with a glass of warm milk and drink it regularly in the morning (drinking it on an empty stomach is more beneficial, you can just lukewarm the milk or have it at room temperature if you face acidity or acid reflux problems). This helps you to overcome dizziness and makes the malady a little more manageable.</span></li>\n</ol>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Gooseberry and Coriander Seeds: Soak one tablespoon of coriander seeds and one tablespoon of gooseberry powder in a glass of drinking water overnight. In the morning, strain and add any kind of natural sugar (honey or jaggery), if required. Drinking this in the morning regularly helps in sudden fainting or the appearance of darkness before the eyes during a vertigo attack.</span></li>\n</ol>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Strawberries: Eat fresh strawberries every day during this condition. Adding a few of them to yogurt will help boost its effectiveness and if you like smoothies and shakes go ahead with a strawberry one but avoid adding sugars to it.</span></li>\n</ol>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Lemongrass Tea: You can try out this tea, especially at the onset of dizziness and nausea. It also helps reduce stress and anxiety, thus helping with anxiety-triggered vertigo. It's very easy to prepare and a fresh brew is much more effective. Consider including this tea in your daily diet. It's very simple to prepare. Just cut the stalks of lemongrass into pieces and pour boiling water over them. Allow it to brew for 5-6 minutes and then strain in the teacup for drinking. If it's summer time, you can let it cool down and add ice cubes to make it an iced tea.</span></li>\n</ol>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Ginger: Go ahead and make your favorite ginger tea or consume ginger in any other form you like. Ginger is considered to be great vertigo food which helps in alleviating lightheadedness and nauseating symptoms. I would recommend a lemon and ginger concoction with a little honey and black pepper for a perfect vertigo drink.</span></li>\n</ol>\n<p> </p>\n<p><span style=\"font-weight: 400;\">     Now let’s move on to general diet recommendations for vertigo patients:</span></p>\n<p> </p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The first and strongly recommended is keeping yourselves hydrated. This is an important lifestyle change that you should seriously consider. Drink lots of water to maintain the fluid level in your body. Have a glass of lemon water or a cup of herbal tea or a glass of fresh fruit juice if you get bored of simple water.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Stay away from high sodium foods and even try to reduce salts in your daily diet. Sodium causes fluid retention in the body that aggravates inner ear symptoms and can give you dizzy and nauseating spells. Form a habit of checking food labels and staying away from high sodium and especially MSG which is a common trigger of vertigo. Skip sauces and dressing on your food and instead go for lemon, pepper, and natural seasonings like oregano, basil, paprika, etc.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Limiting caffeine and alcohol is of high significance in a vertigo diet. They not only fluctuate your blood pressure but also stimulate your nervous system negatively which can lead to vertigo attacks. Also, drinking too much of them will put you at risk of dehydration. </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Stay away from sugars. High sugar levels are a proven trigger of vertigo. Limit their use or stay away from them completely. Eat fresh fruits which are naturally sweet to satisfy your sugar cravings. You can use a limited amount of honey or jaggery but remember they are also a form of sugar and if you are already diabetic you need to be extra careful. Also, avoid white flour products like bread and pastries which quickly increase blood sugar levels.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You must have heard of eating colorful foods and ditching the colorless. It's a simple but very effective way to practice healthy eating. Keep your diet full of fruits and vegetables. Some specific foods you must consider for vertigo are Ginger, Tomatoes, Eggs, Almonds, Herbs and Spices, Seafood, Whole Grains, Berries, Cayenne Pepper, and Spinach. </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Another must for vertigo patients is Vitamin D. Deficiency of the same can also trigger vertigo. So go have an outside day more often under the sun. Take your vitamin D supplements under the guidance of your doctor without fail.</span></li>\n</ol>\n<p> </p>\n<p><span style=\"font-weight: 400;\">4) General precautions for Vertigo Patients:</span></p>\n<p> </p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Sit down or lie down if possible in a quiet, dark room when you feel dizzy and spinning is intense during the episode</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Take precautions while performing head movements and do not jerk it in any way. Give yourself extra time for performing activities that involve triggering head movements like looking up or down or turning it sideways</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Do not get up from a sitting or sleeping position fast or with a jerk</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Squat instead of bending over to pick something up</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Use cane or walking support during the episodes.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Sleep with the head raised on two or more pillows but consult your doctor about it first.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Do not go hungry anytime. Keep yourself well-fed and eat at regular intervals although you can regulate your portions every time.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Hydrate, Hydrate, and Hydrate!</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">If your vertigo episodes are intense and frequent, adapt you home for improving safety and avoiding symptom-provoking activities eg: placing the containers at eye level, avoiding the use of ladders, placing support near the toilet to hold while getting up or sitting down, placing a seater in the bathroom, etc.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Turn on lights when getting up at night to prevent falling</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Ask the doctor whether you should drive and take the suggestion seriously.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Traveling Precautions: Take your vertigo medications with you or pre-medicate yourself as per your doctor, especially while flying and on long train or road travel. Arrive early at the airport or station and give yourself ample time for the proceedings. Do not hurry, as it can give rise to jerky movements triggering vertigo. Take help and support. You can avail the wheelchair facility as well during such times. Keep yourself well hydrated and well-fed. Take your neck pillow if prescribed with you always.</span></li>\n</ul>\n<p> </p>",
            "image": "https://breathingberry.com/media/posts/2/VertigoFinal.jpg",
            "author": {
                "name": "Surbhi Bhosle"
            },
            "tags": [
            ],
            "date_published": "2022-08-21T19:42:27+05:30",
            "date_modified": "2022-08-21T20:14:08+05:30"
        }
    ]
}
